# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Info on Unique Values

In [3]:
# Gives outs unique values in col2
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [8]:
# Number of unique values
print(len(df['col2'].unique()))
# OR
print(df['col2'].nunique())

3
3

In [13]:
# Value counts
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [14]:
# Conditional Selecting Data
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [17]:
# AND operation
df[(df['col1'] > 3) & (df['col1'] < 2)] # None like that happened

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [21]:
# OR operation
df[(df['col1'] > 3) | (df['col1'] < 2)] # Two values true according to the statement

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

### Applying Functions

In [22]:
# defing a fumction
# Simple function which takes in value and return multiply by 2
def times2(x):
    return x*2

In [ ]:
# Apply function used to